[
	{
		"President": {
			"Mark Maligalig":{
				"name": "Mark Maligalig",
				"email": "maligali@ualberta.ca",
				"speech": "Hello! My name is Mark and I’m running to be your president because I want to continue the amazing work Ada’s Team does, especially in helping maintain and build this community. I want to continue our Coffee&&Code seminars, amazing tutoring, but also bring in more casual events related to CS and STEAM.",
				"numOfVotes": 0
			},
			"Abstain": {
				"name": "Abstain",
				"numOfVotes": 0
			}
		},
		"Administration": {},
		"Academic": {},
		"Finance": {
			"Mira Patel":{
				"name": "Mira Patel",
				"email": "mpatel2@ualberta.ca",
				"speech": "Hi everyone, My name is Mira and I am thrilled to be running for the VP Finance and VP Conference - Finance role for the Ada’s team student group. To share a little bit about myself, I am heading into my 4th year as a Computing Science Specialization student. I am the current President for the Undergraduate Artificial Intelligence Society (UAIS) student group. Additionally, my commitment to serving the community through initiatives similar to Ada’s Team has been recognized by several notable institutions. Some of these include YMM Parent Magazine's Top 20 Under 20 Award, The Queen's Jubilee Citizenship Award from the Government of Alberta, and Leadership in Computing Science from the University of Alberta. As a candidate, I promise to bring my strengths and ambitious spirit. I hope explore a variety of initiatives to meet the needs of our student community. You can count on me to be a friendly, reliable and helpful member. As an asset, I bring prior experience in the responsibilities pertaining to this role by having been the Community Development Associate for a non-profit organization, for which I had lead fundraisers, completed grant applications and financially supported a large-scale community event with a target audience of over 300 attendees. My involvement in the logistics for that event included funding for catering, venues, marketing, and more. Using that to my advantage, I am committed to provide dedicated support to the responsibilities of this role. I hope that by fostering a culture that encourages new thoughts and ideas, we can work together to achieve our goals and make a positive impact. With your support, I am confident that we can achieve great things together. Thank you for taking the time to consider my candidacy, and I hope you will consider voting for me as your next VP Finance and VP Conference - Finance.",
				"numOfVotes": 0
			},
			"Abstain": {
				"name": "Abstain",
				"numOfVotes": 0
			}
		},
		"Digital Media": {},
		"Communications": {},
		"Campus Outreach": {},
		"Industry Outreach": {},
		"Conference Operations": {},
		"Conference Campus Relations": {},
		"Conference Finance": {
			"Mira Patel":{
				"name": "Mira Patel",
				"email": "mpatel2@ualberta.ca",
				"speech": "Hi everyone, My name is Mira and I am thrilled to be running for the VP Finance and VP Conference - Finance role for the Ada’s team student group. To share a little bit about myself, I am heading into my 4th year as a Computing Science Specialization student. I am the current President for the Undergraduate Artificial Intelligence Society (UAIS) student group. Additionally, my commitment to serving the community through initiatives similar to Ada’s Team has been recognized by several notable institutions. Some of these include YMM Parent Magazine's Top 20 Under 20 Award, The Queen's Jubilee Citizenship Award from the Government of Alberta, and Leadership in Computing Science from the University of Alberta. As a candidate, I promise to bring my strengths and ambitious spirit. I hope explore a variety of initiatives to meet the needs of our student community. You can count on me to be a friendly, reliable and helpful member. As an asset, I bring prior experience in the responsibilities pertaining to this role by having been the Community Development Associate for a non-profit organization, for which I had lead fundraisers, completed grant applications and financially supported a large-scale community event with a target audience of over 300 attendees. My involvement in the logistics for that event included funding for catering, venues, marketing, and more. Using that to my advantage, I am committed to provide dedicated support to the responsibilities of this role. I hope that by fostering a culture that encourages new thoughts and ideas, we can work together to achieve our goals and make a positive impact. With your support, I am confident that we can achieve great things together. Thank you for taking the time to consider my candidacy, and I hope you will consider voting for me as your next VP Finance and VP Conference - Finance.",
				"numOfVotes": 0
			},
			"Sumaiya Salsabil":{
				"name": "Sumaiya Salsabil",
				"email": "salsabil@ualberta.ca",
				"speech": "Hi! My name is Sumaiya and I’m currently going into my fifth year at UofA doing a double major in computer science and psychology! I’m really passionate about what this club stands for - promoting diversity in a field that’s known to lack it and empowering underrepresented students. I’ve been a general member and have been attending Ada’s Team events for the past few years and it’s been such a great experience, I’d love to take my involvement to the next level and contribute as the next VP Conference - Finance. I also have experience as an exec in student groups like Outrun the Stigma, where I was a co-chair and worked closely with the finance team to significantly increase the funds we raised (over 4 times the previous years!), enabling us to make a greater impact. I also had the opportunity to volunteer as the Director of Finance for Women Empowering Women UAlberta. I’d love to get the chance to apply the skills I learned from those roles to a group like Ada’s Team that is essential in creating an inclusive environment where every student can flourish.",
				"numOfVotes": 0
			},
			"Abstain": {
				"name": "Abstain",
				"numOfVotes": 0
			}
		}
	}
]
